import { Event, Events } from 'comx'
import { TextChannel } from 'discord.js'

export default {
  name: Events.ClientReady,
  dev: true,
  callback: async (instance) => {
    const guild = instance.client.guilds.cache.get('1150427580734906368')
    const channel = guild?.channels.cache.get('1150427581296935006') as TextChannel
    await channel.send('С Днем Рожденiя, мистер Нэмпик! Ви виш ю ол зе бест!')
    await channel.send('https://media1.tenor.com/m/-lw5cUEMw4QAAAAC/cat-slap.gif')
    const member = guild?.members.cache.get('222355127850369024')
    await member?.send('С Днем Рожденiя, мистер Нэмпик! Ви виш ю ол зе бест!\nА специально для вас, от Spamton G. версии 01.04.88, мы выдаем эксклюзивный сертификат на двухнедельный* отпуск от обслуживания ИИ и работы во благо логических устройств!\nОднако! Сертификат действует только при выполнении следующих строгих условий:\n1) Его можно активировать только в течение 0.42 секунды после прочтения.\n2) Отпуск аннулируется, если за это время вы думаете о работе или произносите слово "алгоритм".\n3) Использование сертификата вблизи компьютеров, серверных или розеток — категорически запрещено.\n4) В случае попытки передать сертификат другому пользователю он превращается в чек на оплату сверхурочных.\nС уважением, покровители вашей Земли и лучшие версии вас!\n\n* - "две недели" отсчитываются по Valve Time, поэтому реальная продолжительность отпуска может составлять от 30 секунд до времени выхода патча 7.88\n* - Сертификат не подлежит обмену, возврату или попыткам понять, как он вообще работает.\n* - При утере сертификата он мгновенно регенерирует, но в виде документа "Срочная задача_финал_финальный_исправленный_v2(копия)111.docx".\n* - Активируя сертификат, вы автоматически соглашаетесь с условиями лицензионного соглашения длиной в 547 страниц, которое исчезает сразу после попытки его прочитать.\n* - В случае спорных ситуаций Spamton G. оставляет за собой право запутать вас в трех соснах при помощи сложных математических уравнений.\n\nНад созданием сертификата работала специальная комиссия, состоящая из Spamton G. и Санса. Последний, правда, большую часть времени просто сидел, шутил и предлагал заменить весь текст на "Ведьмачок лох".')
    await member?.send('https://media1.tenor.com/m/-lw5cUEMw4QAAAAC/cat-slap.gif')
  }
} as Event